CATEGORY_TREE: dict = {
    "收入": {
        "工资": {},
        "年终": {},
        "退税": {},
        "公积金": {},
        "结息": {},
    },
    "支出": {
        "餐饮": {
            "早饭": {},
            "午饭": {},
            "晚饭": {},
            "水果": {},
            "零食": {},
            "饮料": {},
        },
        "交通": {
            "地铁": {},
            "公交": {},
            "打车": {},
            "火车": {},
            "飞机": {},
            "共享单车": {},
        },
        "衣服": {
            "运动装备": {},
        },
        "起居": {
            "房租": {},
            "水费": {},
            "电费": {},
            "燃气费": {},
            "网费": {},
            "物业费": {},
            "话费": {},
            "快销品": {},
        },
        "娱乐": {
            "电影": {},
            "游戏": {},
            "场地门票报名": {},
        },
        "学习": {},
        "礼物": {},
    },
}
