"""
Python dict性质天然保证不会出现有歧义的路径
"""

CATEGORY_TREE: dict = {
    "收入": {
        "工资": {},
        "年终": {},
        "退税": {},
        "公积金": {},
        "结息": {},
    },
    "支出": {
        "餐饮": {
            "早饭": {},
            "午饭": {},
            "晚饭": {},
            "水果": {},
            "零食": {},
            "饮料": {},
            "酒水": {},
            "路餐": {},  # 户外
        },
        "交通": {
            "地铁": {},
            "公交": {},
            "打车": {},
            "顺风车": {},
            "火车": {},
            "飞机": {},
            "共享单车": {},
        },
        "购物": {
            "衣服": {},
            "装备": {},  # 运动装备
            "快销": {},  # 日用品, 床上用品, 卫生用品, 厨房用品
            "礼物": {},
            "运费": {},
        },
        "起居": {
            "房租": {},
            "水费": {},
            "燃气费": {},
            "电费": {},
            "网费": {},
            "物业费": {},
            "话费": {},  # 包括VPN费用
            "理发": {},
        },
        "娱乐": {
            "住宿": {},  # 酒店
            "电影": {},
            "游戏": {},
            "场地门票报名": {},
            "服务": {},  # 捏脚、按摩、汤泉、KTV
        },
        "金融": {
            "手续费": {},
        },
        "学习": {},
        "医疗": {},
        "捐献": {},
        "创业": {},
    },
    "转入": {
        "对齐": {},
        "退款": {},  # 通常与支出对应
        "AA": {},
        "红包": {},
        "还款": {},  # 与 转出 -> 借钱 对应
    },
    "转出": {
        "对齐": {},
        "借钱": {},
    },
}
